// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = +prompt('Введіть довільне число: ')
if (x !== 0) {
    console.log('Вірно')
} else {
    console.log('Невірно')
}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = +prompt('Введіть число від 0 до 59: ')
if (time < 16) {
    console.log('Перша частина години')
} else if (time > 15 && time < 31) {
    console.log('Друга частина години')
} else if (time > 30 && time < 46) {
    console.log('Третя частина години')
} else if (time > 45 && time < 60) {
    console.log('Четверта частина години')
} else {
    console.log('????')
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt('Введіть число від 1 до 31: ')
if (day < 11) {
    console.log('Перша декада місяця')
} else if (day < 21) {
    console.log('Друга декада місяця')
} else if (day < 32) {
    console.log('Третя декада місяця')
} else {
    console.log('????')
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let week = +prompt('Введіть порядковий номер дня тижня: ')
switch (week) {
    case 1 :
        console.log('Monday')
        break
    case 2 :
        console.log('Tuesday')
        break
    case 3 :
        console.log('Wednesday')
        break
    case 4 :
        console.log('Thursday')
        break
    case 5 :
        console.log('Friday')
        break
    case 6 :
        console.log('Saturday')
        break
    case 7 :
        console.log('Sunday')
        break
    default:
        console.log('????');
}

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let x1 = +prompt('Введіть перше число: ')
let x2 = +prompt('Введіть друге число: ')
if (x1 > x2) {
    console.log('Більше число: ', x1)
} else if (x2 > x1) {
    console.log('Більше число: ', x2)
} else {
    console.log('Числа рівні')
}

// Або то, Або це

let y1 = 10
let y2 = 5
if (y1 > y2) {
    console.log('Більше число: ', y1)
} else if (y2 > y1) {
    console.log('Більше число: ', y2)
} else {
    console.log('Числа рівні')
}

//     - є змінна y, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let y = prompt() || 'default'
console.log(y)